{"Workers":{"+Tasks":{"Pending":["Create scheduler that deletes files from Config.temp_folder that are older than X amount of time. To clean up stale certificates.","Load the admin website for resque-retry in Procfile","Evaluate @backoff_strategy in the BaseWorker. Update it so that it lasts at least several months of attempts in exponential backoff.","Break this into a GEM in the future. Also dont include libraries that arent really needed. Simplify transaction model in the future so that workers have a state machine a simple db representation they can interact with.","DEPRECATION WARNING: Resque::Worker verbose and very_verbose are deprecated. Please set Resque.logger.level instead","Si redis se cae se cae todo el Foreman: workers website scheduler","Si redis se cae se cae todo el Foreman: workers website scheduler - hacer para tener un process que lo restartea todo al regresar la conexión","Update the Port for TWEMPROXY in db.json for both API and GMQ worker","Update redis.conf for redis1 so that it uses default port","Update db.json in production to use nutcracker.","Check to see if transactions are repeating themselves in a single request.","Create a share for all worker servers, where we can create certificates and pdfs","LocalTransactionNotFound should not be a candiate for a retry","If the configured system temp_folder doesnt exist create it","Checksum all files that we put in OGP","worker actions against DB should be against API - stats - transaction updates - library helpers","figure out why finalemailworker is showing the full payload on the verbose mode in resque","Consider adding binary payloads in the mailers mail method so we dont need to write the file to disk","Add real code to the mainteance mode in the base worker","config logger with loggin strategy smiliar to GMQ for space utilization","Either fully adopt config user.json and authentication.rb module or remove it and continue with .env not both","move to rest-client from rest_client"],"Done":["rapsheetworker: do not retry if LocalTransactionNotFound","Dont retry RapsheetWorker or any worker if tx ID is not found. If it is invalid.","MissingTransactionId should not be an error candidate for a retry."]}}}
